# Дано целое число N (> 1). Вывести наибольшее из целых чисел K, для которых сумма 1 + 2 +...+ K будет меньше или равна
# N, и саму эту сумму.
try:  # Обработка исключений
    n = int(input("Введите N: "))
    if n > 1:  # проверка на условие
        k = 0
        summa = 0
        while not (summa+k+1 > n):  # цикл интервала
            k += 1
            summa += k
        print("Сумма =", summa, "\nЧисло К =", k)
    else:
        print("Число N < 1 ")
except ValueError:  # обработка исключений
    print("Введите число")