#Даны два целых числа A и B (А < B). Ввести в порядке убывания все целые числа, расположенные между А и В (не включая
#числа А и В), а также количество N этих чисел.
try: #обработка исключений
    a = int(input("Введите А: "))
    b = int(input("Введите B: "))
    if a < b: #проверка на условие
        print("n =", b-a-1)
        while b != a + 1: #цикл интервала
            b = b-1
            print(b, end=",")
    else:
         print("A должно быть меньше B")
except: #обработка исключений
    print("Введите число!")