# Описать функцию InvertDigits(К), меняющую порядок следования цифр целого положительного числа К на обратный
# К-параметр целого типа, являющийся одновременно входным и выходным). С помощью этой функции поменять порядок
# следования цифр на обратной для каждого из пяти данных чисел.

import math  # ввод математических данных(чисел)

def InvertDigits(k):  # функция, меняющая порядок цифр на обратный
    temp = 0  # временный аргумент
    while k != 0:  # цикл, меняющий порядок цифр на обратный
        temp = temp * 10 + math.fmod(k, 10)
        k = int(k / 10)
    return temp

i = 0
while i < 5:  # цикл для пяти чисел
    print("Введите число K: ")
    k = int(input())
    i = i + 1
    print("Обратный порядок цифр: ", int(InvertDigits(k)))  # вывод, вызов функции