''' Средствами языка Python сформировать два текстовых файла (.txt), содержащих по одной последовательности из целых
положительных и отрицательных чисел. Сформировать новый текстовый файл (.txt) следующего вида, предварительно выполнив
требуемую обработку элементов:
Элементы первого и второго файлов:
Элементы первого файла, отсутствующие во втором:
Элементы второго файла, отсутствующие в первом:
Количество элементов:
Индекс первого минимального элемента:
Индекс последнего максимального элемента:'''

import random

# генерация чисел
list_2 = [random.randint(-10, 20) for _ in range(random.randint(5, 20))]
list_3 = [random.randint(-10, 20) for _ in range(random.randint(5, 30))]
list_4 = list_2 + list_3

# создание первого файла
f1 = open("file_1.txt", "w", encoding="UTF-8")
f1.write(f"Положительные значения: {[i for i in list_2 if i > 0]}\n")
f1.write(f"Отрицательные значения: {[i for i in list_2 if i < 0]}\n")
f1.close()

# создание второго файла
f2 = open("file_2.txt", "w", encoding="UTF-8")
f2.write(f"Положительные значения: {[i for i in list_3 if i > 0]}\n")
f2.write(f"Отрицательные значения: {[i for i in list_3 if i < 0]}\n")
f2.close()

# создание третьего файла, свод данных в него
f3 = open("file_3.txt", "w", encoding="UTF-8")
f3.write(f"Элементы первого и второго файлов:"
         f" {list_2+list_3}\n")
f3.write(f"Элементы первого файла, отсутствующие во втором: {set(list_2) - set(list_3)}\n")
f3.write(f"Элементы второго файла, отсутствующие в первом: {set(list_3) - set(list_2)}\n")
f3.write(f"Количество элементов: {len(list_4)}\n")

# подсчет индекса последнего минимального элемента.
k = 0  # счетчик
id = 0  # счетчик

# генератор минимального и максимального чисел
for i in range(len(list_4)):
    if list_4[k] > list_4[i]:
        k = i
for j in range(len(list_4)):
    if list_4[id] < list_4[j]:
        id = j

# запись данных в файл
f3.write(f"Индекс первого минимального элемента: {k}\n")
f3.write(f"Индекс последнего максимального элемента: {id}\n")
f3.close()

