# Даны целые положительные числа N1 и N2 и строки S1 и S2. Получить из этих строк
# новую строку, содержащую первые N1 символов строки S1 и последние N2 символов строки S2 (в указанном порядке).
n1 = 3
n2 = 4
s1 = "123123123"
s2 = "45674567"
s3 = s1[0:n1] + s2[-n2:]
print(s3)