#Даны числа x, y. Проверить истинность высказывания: «Точка с координатами (x, y) лежит в четвертой координатной четверти.
try: #обработка исключений
    x = int(input("Введите x: "))
    y = int(input("Введите y: "))

    if x > 0 and y < 0:
        print("Координаты лежат в четвертой четверти")
    else:
        print("Координаты не лежат на четвертой четверти")
except Exception as ex: #обработка исключений
    print(ex)