#Даны целые числа a, b, c. Проверить истинность высказывания: «Существует треугольник со сторонами a, b, c».
try: #обработка исключений
    a = int(input("Введите a: "))
    b = int(input("Введите b: "))
    c = int(input("Введите c: "))
    if a + b > c and b + c > a and a + c > b:
        print("Треугольник существует")
    else:
        print("Треугольник не существует")
except Exception as ex: #обработка исключений
    print(ex)
