# Дан список ненулевых целых чисел размера N. Проверить, чередуются ли в нем
# положительные и отрицательные числа. Если чередуются, то вывести 0, если нет, то
# вывести порядковый номер первого элемента, нарушающего закономерность

n = int(input("N: "))  # ввод длины списка
spis = []
for i in range(n):  # ввод списка
    spis.append(int(input("Порядковый номер " + str(i + 1) + " = ")))

k=0
for i in range(len(spis) - 1):  # функция, определяющая чередование
    if spis[i]<0 and spis[i+1]>=0:
        continue
    elif spis[i]>=0 and spis[i+1]<0:
        continue
    else:
        k=i+2
        break
print(k)