# Дано множество A из N точек (N > 2, точки заданы своими координатами x, у). Найти
# такую точку из данного множества, сумма расстояний от которой до остальных его
# точек минимальна, и саму эту сумму.
# Расстояние R между точками с координатами (x1, y1) и (x2, у2) вычисляется по формуле:
# R = √(x2 – x1)2 + (у2 – y1)2.
# Для хранения данных о каждом наборе точек следует использовать по два списка: первый
# список для хранения абсцисс, второй — для хранения ординат

import math

n = int(input("Введите количество точек: "))  # ввод количества точек
x = []
y = []
for i in range(n):   # функция ввода координат
    x.append(int(input("Введите координату x" + str(i + 1) + ": ")))
    y.append(int(input("Введите координату y" + str(i + 1) + ": ")))

sum =[]  # список сумм

for h in range(n):  # функция нахождения сумм расстояний
    s = 0
    for i in range(n - 1):
        r = (math.sqrt(pow((x[0] - x[i + 1]), 2) + pow((y[0] - y[i + 1]), 2)))
        s += r

    x.append(x[0])   # прокрутка списка координат
    y.append(y[0])
    x = x[1:]
    y = y[1:]
    sum.append(round(s, 2)) # ввод в список сумм с округлением до двух чисел после запятой
print("Минимальная сумма расстояний: ",min(sum))
print("Координаты точки: (", x[sum.index(min(sum))],";",y[sum.index(min(sum))],")")