# Дан целочисленный список A размера N (< 15). Переписать в новый целочисленный
# список B все элементы с нечетными порядковыми номерами (1,3,...) и вывести
# размер полученного списка B и его содержимое. Условный оператор не
# использовать.

n = int(input("N: "))  # ввод длины списка
while n > 14:
    n -=1

a = []
for i in range(n):  # ввод списка
    a.append(int(i) + 1)

print("Список A = ",a)

b = a[::2]  # список B

print("Новый список с нечётными порядковыми элементами первого списка = ",b)
print("Размер полученного списка = ",len(b))
