# Книжные магазины предлагают следующие коллекции книг.
# Магистр – Лермонтов, Достоевский, Пушкин, Тютчев
# ДомКниги – Толстой, Грибоедов, Чехов, Пушкин.
# БукМаркет – Пушкин, Достоевский, Маяковский.
# Галерея – Чехов, Тютчев, Пушкин. Определить:
# 1. Полный список всех книг магазинов.
# 2. Какие книги есть во всех магазинах.
# 3. Хотя бы одну книгу, которая есть не во всех магазинах.

try:
    d = {"Лермонтов", "Достоевский", "Пушкин", "Тютчев", "Толстой", "Грибоедов", "Чехов", "Маяковский"}  # общий список

    magistr = {"Лермонтов", "Достоевский", "Пушкин", "Тютчев"}
    housebook = {"Толстой", "Грибоедов", "Чехов", "Пушкин"}
    bookmarket = {"Пушкин", "Достоевский", "Маяковский"}
    gallery = {"Чехов", "Тютчев", "Пушкин"}

    print("Полный список книг всех магазинов: ", magistr, housebook, bookmarket, gallery)
    print("Есть во все магазинах: ", magistr & housebook & bookmarket & gallery)
    print("Есть не во всех магазинах: ", magistr - housebook - bookmarket - gallery)
except:
    print("Ошибка")
