info_sotr = [
    (4,"Иван", "Абаканов", "1995-03-20", "Мужской", "2020-07-13", "Оператор", "Отдел связи", 40000),
    (42, "Арина", "Ковалева", "1982-03-16", "Женский", "2010-10-25", "Организатор мероприятий", "Отдел досуга", 45000),
    (10, "Айнура", "Кененсарова", "1962-12-08", "Женский", "2016-04-16", "Уборщица", "Отдел чистоты", 20000),
    (31, "Максим", "Тимофеев", "1989-05-20", "Мужской", "2018-02-22", "Веб-программист", "Отдел IT", 130000),
    (25, "Владимир", "Анатольев", "1984-09-24", "Мужской", "2013-03-29", "Сиситемный администратор", "Отдел IT", 105000),
    (45, "Мария", "Васильева", "1998-06-23", "Женский", "2022-03-15", "Тестировщик", "Отдел IT", 110000),
    (17, "Игорь", "Юшкин", "1987-05-20", "Мужской", "2013-08-02", "Менеджер", "Отдел маркетинга", 60000),
    (13, "Ярослав", "Серов", "1978-03-26", "Мужской", "2012-07-09", "Менеджер", "Отдел маркетинга", 63500),
    (26, "Александр", "Петров", "1994-08-29", "Мужской", "2019-01-20", "Проектировщик БД", "Отдел IT", 70500),
    (29, "Екатерина", "Божова", "1999-04-10", "Женский", "2018-11-22", "Руководитель отдела продаж", "Отдел продаж", 35000)
]

info_listi = [
    (62, 4, "2020-12-03", "2020-12-10", "Болезнь", "ОРВИ", True),
    (14, 42, "2013-08-20", "2015-03-02", "Декрет", "Беременность", True),
    (25, 10, "2018-02-12", "2018-03-20", "Травма", "Перелом руки", True),
    (50, 31, "2019-05-16", "2019-05-24", "Болезнь", "Грипп", True),
    (54, 25, "2015-07-09", "2015-08-01", "Травма", "Растяжение связок", True),
    (76, 45, "2023-04-02", "2023-04-11", "Болезнь", "ОРВИ", False),
    (42, 17, "2021-02-27", "2021-04-02", "Карантин", "Covid-19", True),
    (80, 13, "2023-04-06", "2023-04-20", "Травма", "Растяжение связок", False),
    (37, 26, "2021-06-24", "2021-08-20", "Болезнь", "Covid-19", True),
    (57, 29, "2022-03-09", "2022-03-21", "Травма", "Ушиб", True)
]